## Top Movies DataSet

Using the top movies dataset located in `week_2/data/top_movies.csv`, implement the following lines of pseudocode below for each code block.

For some lines of pseudocode you will have to utilize your searching skills to figure out which method we need. Consult google or the [pandas docs](https://pandas.pydata.org/) to accomplish this.

Notice that this data is sorted according to movie rank in descending order. 

Afterwards, answer questions 1 through 5 using the information gained.

In [8]:
import pandas as pd

# read in your csv data using pandas

In [17]:
# print out the first 5 rows of your data 
# hint: https://pythonexamples.org/pandas-dataframe-head-get-first-n-rows/

                 Movie_Name  Release_date  Rating
0  The Shawshank Redemption          1994     9.2
1             The Godfather          1972     9.2
2           The Dark Knight          2008     9.0
3     The Godfather Part II          1974     9.0
4              12 Angry Men          1957     9.0

In [16]:
# print out the last 5 rows of your data
# hint: https://stackoverflow.com/questions/14663004/how-to-get-the-last-n-rows-of-a-pandas-dataframe

         Movie_Name  Release_date  Rating
245     Dersu Uzala          1975     8.0
246         Aladdin          1992     8.0
247        The Help          2011     8.0
248  The Iron Giant          1999     8.0
249          Gandhi          1982     8.0

In [28]:
# display the column name, column type, and how many null values you have in your dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Movie_Name    250 non-null    object
 1   Release_date  250 non-null    int64
 2   Rating        250 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.0+ KB

In [15]:
# print out summary statistics of your dataframe

       Release_date      Rating
count    250.000000  250.000000
mean    1986.488000    8.252800
std       25.225287    0.236125
min     1921.000000    8.000000
25%     1966.250000    8.100000
50%     1994.000000    8.200000
75%     2006.750000    8.400000
max     2022.000000    9.200000

## Q1

Which movie has the highest ranking in this dataset?

## Q2

Which movie has the lowest ranking in this dataset?

## Q3

What is the average movie rating in this dataset?

## Q4

In what year was the oldest movie in this dataset released?

## Q5

In what year was the newest movie in this dataset released?

## State GDP Analysis

Using the states gdp dataset located in `week_2/data/state_gdp.csv`, implement the following lines of pseudocode below for each code block.

For some lines of pseudocode you will have to utilize your searching skills to figure out which method we need. Consult google or the [pandas docs](https://pandas.pydata.org/) to accomplish this.

Afterwards, answer questions 6 through 10 using the information gained.

In [19]:
import pandas as pd

# load dataframe here

,GeoFIPS,GeoName,Description,Unit,1997,1998,1999,2000,2001,2002,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,"""01000""",Alabama,All industry total,Millions of current dollars,104716.9,110181.3,115833.1,120132.9,123035.3,128117.4,...,181929.9,186553.9,192166.5,195037.7,200197.5,204454.7,210895.7,221030.7,228142.6,224870.6
1,"""02000""",Alaska,All industry total,Millions of current dollars,25800.0,24227.6,24779.3,26815.8,28455.4,29633.4,...,56333.9,57717.5,56625.3,55750.6,50728.1,49755.6,51737.0,54292.9,54385.6,50246.7
2,"""04000""",Arizona,All industry total,Millions of current dollars,132290.9,143286.2,155282.6,164609.9,171480.5,179475.6,...,257881.1,268068.2,275007.5,284851.4,298615.0,313056.5,330146.6,350718.3,370119.1,372461.0
3,"""05000""",Arkansas,All industry total,Millions of current dollars,59826.9,62397.8,66791.2,68740.4,70680.3,73986.5,...,105107.8,107718.8,112764.6,116151.8,117734.3,119191.8,122978.5,127761.3,130954.1,129073.9
4,"""06000""",California,All industry total,Millions of current dollars,1071327.2,1147944.3,1247734.4,1366166.5,1387551.8,1439341.7,...,2049336.8,2144089.6,2261510.6,2399077.7,2559643.2,2671100.5,2831038.4,2975083.0,3132800.6,3091871.5

In [26]:
# get dimensions of dataframe

,GeoFIPS,GeoName,Description,Unit,1997,1998,1999,2000,2001,2002,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
46,"""51000""",Virginia,All industry total,Millions of current dollars,215126.0,231505.4,249106.3,267618.0,284396.6,293399.4,...,433009.6,445120.7,455166.9,464514.4,484530.8,496570.2,511876.3,533510.4,556905.2,551760.3
47,"""53000""",Washington,All industry total,Millions of current dollars,193770.2,209710.4,230237.4,238137.1,239763.4,248152.7,...,379796.4,400623.3,419671.3,442930.0,471702.8,493634.5,527707.5,575416.7,612996.5,618704.9
48,"""54000""",West Virginia,All industry total,Millions of current dollars,38808.2,40053.8,41796.4,42577.4,43982.8,45433.6,...,68446.8,69335.6,70998.6,71769.1,70815.9,70006.2,72853.1,77632.5,78863.9,73709.2
49,"""55000""",Wisconsin,All industry total,Millions of current dollars,153424.9,162616.5,172328.7,180616.3,187974.0,194844.9,...,264166.4,274540.5,281832.6,293836.7,306498.9,313440.2,320610.0,337553.1,349416.5,338678.4
50,"""56000""",Wyoming,All industry total,Millions of current dollars,14708.7,14883.8,15715.0,17191.8,18691.2,19149.7,...,39415.2,38437.7,38943.0,39431.7,37860.7,35704.0,37271.2,39703.2,40420.1,36241.5

In [ ]:
# get summary statistics of dataframe

## Q6

How many rows does this dataframe contain?

## Q7

How many columns does this dataframe contain?

## Q8

What was the maximum GDP for 2003?

## Q9

What was the minimum GDP for 2003?

## Q10

What was the mean GDP for 2003?